# YOLOv8n with TransformerLayer after backbone
depth_multiple: 0.33
width_multiple: 0.25
nc: 41

# custom_ghost.yaml

# YOLOv8n with GhostConv
backbone:
  [[-1, 1, GhostConv, [64, 3, 1]],     # 0-P1/2
   [-1, 1, GhostConv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C2f, [128]],
   [-1, 1, GhostConv, [256, 3, 2]],    # 3-P3/8
   [-1, 3, C2f, [256]],
   [-1, 1, GhostConv, [512, 3, 2]],    # 5-P4/16
   [-1, 3, C2f, [512]],
   [-1, 1, GhostConv, [1024, 3, 2]],   # 7-P5/32
   [-1, 1, SPPF, [1024, 5]],           # 8
  ]

head:
  [[-1, 1, GhostConv, [512, 1, 1]],    # 9
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],          # cat backbone P4
   [-1, 3, C2f, [512]],                # 12

   [-1, 1, GhostConv, [256, 1, 1]],    # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],          # cat backbone P3
   [-1, 3, C2f, [256]],                # 16

   [-1, 1, GhostConv, [256, 3, 2]],    # 17
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C2f, [512]],

   [-1, 1, GhostConv, [512, 3, 2]],    # 20
   [[-1, 9], 1, Concat, [1]],
   [-1, 3, C2f, [1024]],               # 22

   [[17, 20, 22], 1, Detect, [nc]]     # Detect heads
  ]
