# YOLOv10 Backbone + YOLOv11 Head
nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 P2/4
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, SCDown, [512, 3, 2]]       # 5 P4/16
  - [-1, 6, C2f, [512, True]]          # 6
  - [-1, 1, SCDown, [1024, 3, 2]]      # 7 P5/32
  - [-1, 3, C2fCIB, [1024, True, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9 backbone output
  - [-1, 1, PSA, [1024]] # 10


head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 10
  - [[-1, 6], 1, Concat, [1]]                 # 11
  - [-1, 2, C3k2, [512, False]]               # 12

  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 13
  - [[-1, 4], 1, Concat, [1]]                 # 14
  - [-1, 2, C3k2, [256, False]]               # 15

  - [-1, 1, Conv, [256, 3, 2]]                # 16
  - [[-1, 12], 1, Concat, [1]]                # 17
  - [-1, 2, C3k2, [512, False]]               # 18

  - [-1, 1, Conv, [512, 3, 2]]                # 19
  - [[-1, 9], 1, Concat, [1]]                 # 20
  - [-1, 2, C3k2, [1024, True]]               # 21

  - [[12, 15, 21], 1, Detect, [nc]]           # Correct detect indices
    # Detect(P3, P4, P5) from C3k2 outputs    