# Hybrid YOLOv11 Backbone + YOLOv8 Head
nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7 P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9 backbone output
  - [-1, 2, C2PSA, [1024]] # 10

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 10
  - [[-1, 6], 1, Concat, [1]]                 # 11
  - [-1, 3, C2f, [512]]                        # 12

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 13
  - [[-1, 4], 1, Concat, [1]]                 # 14
  - [-1, 3, C2f, [256]]                        # 15

  # P3 -> P4 (down)
  - [-1, 1, Conv, [256, 3, 2]]                # 16
  - [[-1, 12], 1, Concat, [1]]                # 17
  - [-1, 3, C2f, [512]]                        # 18

  # P4 -> P5 (down)
  - [-1, 1, Conv, [512, 3, 2]]                # 19
  - [[-1, 9], 1, Concat, [1]]                 # 20
  - [-1, 3, C2f, [1024]]                       # 21

  - [[12, 15, 21], 1, Detect, [nc]]
    # Detect(P3, P4, P5) from C2f outputs   